Revit 2024 API
SpecTypeId.CostRateEnergy Property
 Cost Rate Energy, in discipline Electrical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId CostRateEnergy { get; }
Visual Basic
Public Shared ReadOnly Property CostRateEnergy As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ CostRateEnergy {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace